Revit 2027 API
AttachmentLocation Enumeration
 Represents the attachment location of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AttachmentLocation
Public Enumeration AttachmentLocation
public enum class AttachmentLocation
type AttachmentLocation
Members
Member name | Value | Description
Base | 0 |  The attachment is made at the base of the element.
Top | 1 |  The attachment is made at the top of the element.
See Also
Reference
Autodesk.Revit.DB Namespace